import {T_Code} from "src/modules/types.ts";

export const CodeMocks:T_Code[] = [
    {
        id: 1,
        name: "1010",
        status: 1,
        image: "",
        description: "Дивиденды — это часть прибыли, которой компания делится с инвесторами, владеющими их акциями. Некоторые компании выплачивают дивиденды от 1 до 12 раз в год — периодичность и размер выплат указываются в дивидендной политике конкретной компании.",
        decryption: "Дивиденды"
    },
    {
        id: 2,
        name: "1220",
        status: 1,
        image: "",
        description: "Под страховыми взносами понимаются обязательные платежи на обязательное пенсионное страхование, обязательное социальное страхование на случай временной нетрудоспособности и в связи с материнством, на обязательное медицинское страхование.",
        decryption: "Суммы страховых взносов"
    },
    {
        id: 3,
        name: "1537",
        status: 1,
        image: "",
        description: "Процент по займу – это сумма, которую клиент платит за пользование средствами, полученными в долг.",
        decryption: "Доходы в виде процентов по займу"
    },
    {
        id: 4,
        name: "1549",
        status: 1,
        image: "",
        description: "Ценная бумага — это финансовое средство, дающее заимодавцу (инвестору) обеспеченное законом право получать в будущем определенный доход в установленном порядке.",
        decryption: "Доходы, полученные по операциям с ценными бумагами"
    }
]